#### Terraform Plan for `30_app` layer
<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
module.main.module.runtime_code_modules.module.api_server_package.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.worker_package.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.practice_util.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.api_server_package.data.local_file.signatures: Read complete after 0s [id=07067372a298c32bf5246345fbaa1ac3605ac888]
module.main.module.runtime_code_modules.module.worker_package.data.local_file.signatures: Read complete after 0s [id=97002abb2822b5614c7b8044bbcc622710bb1766]
module.main.module.runtime_code_modules.module.practice_util.data.local_file.signatures: Read complete after 0s [id=1d3cde1f97bee6b7ac5d1289ba8dfc5395e9959b]
module.main.module.runtime_code_modules.module.cron_server_package.data.local_file.signatures: Reading...
module.main.module.runtime_code_modules.module.cron_server_package.data.local_file.signatures: Read complete after 0s [id=287d039cb6506b459a82296fb432e4406653d449]
module.main.module.eventbridge_target[0].aws_iam_role.eventbridge: Refreshing state... [id=tt-practice-dev-eventbridge-target-role]
module.main.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.main.module.api_server.module.lambda_fastapi_server.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/tt-practice-dev-api-server]
module.main.module.worker.module.lambda_sqs_worker.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/tt-practice-dev-worker]
module.main.module.cron_server.module.lambda_cron_server.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/tt-practice-dev-cron-server]
module.main.data.aws_caller_identity.current: Reading...
module.main.module.runtime_code_modules.module.practice_util.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1]
module.main.module.runtime_code_modules.module.api_server_package.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies:1]
module.main.data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.main.module.runtime_code_modules.module.cron_server_package.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies:1]
module.main.module.runtime_code_modules.module.worker_package.aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies:1]
data.aws_caller_identity.current: Read complete after 0s [id=057336397237]
data.terraform_remote_state.infra: Reading...
module.main.data.aws_caller_identity.current: Read complete after 0s [id=057336397237]
data.terraform_remote_state.infra: Read complete after 2s
module.main.module.api_server.module.lambda_fastapi_server.aws_lambda_function.fastapi_server: Refreshing state... [id=tt-practice-dev-api-server]
module.main.module.cron_server.module.lambda_cron_server.aws_lambda_function.cron_server: Refreshing state... [id=tt-practice-dev-cron-server]
module.main.module.worker.module.lambda_sqs_worker.aws_lambda_function.sqs_worker: Refreshing state... [id=tt-practice-dev-worker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.main.module.runtime_code_modules.module.api_server_package.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "J7Zjon8rFe60tuwu8mIheZRBJlJrn2SK7H24WjVqO+E=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:24.784+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/api_server/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/api_server/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:api_server_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "J7Zjon8rFe60tuwu8mIheZRBJlJrn2SK7H24WjVqO+E=" -> "ZmP+duk5qIsNON1/wPSdL9nlJt+BsYypwcXHT/B/HVk=" # forces replacement
      ~ source_code_size            = 15198683 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.main.module.runtime_code_modules.module.cron_server_package.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "S3HnrDXYdGBgCT3IfdXo1VE4cp99agHwdU2SadHYjAg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:19.704+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/cron_server/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/cron_server/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:cron_server_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "S3HnrDXYdGBgCT3IfdXo1VE4cp99agHwdU2SadHYjAg=" -> "Xid9zE2dYkq9qD+msmUdGT9ukgxp6TnXnJKU6y3Lkcs=" # forces replacement
      ~ source_code_size            = 15198683 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.main.module.runtime_code_modules.module.practice_util.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "NcpClwjTeeX3kk9oi0wbIq6KA3v/ibsYjpwGbS6+yJ8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:32.772+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/practice_util/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/practice_util/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:practice_util_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "NcpClwjTeeX3kk9oi0wbIq6KA3v/ibsYjpwGbS6+yJ8=" -> "z26x037x70b810dhIf1ouSZTnc51oawF13L18EsrK8Y=" # forces replacement
      ~ source_code_size            = 15201284 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.main.module.runtime_code_modules.module.worker_package.aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies:1" -> (known after apply)
      ~ code_sha256                 = "GWmc+c1l/xdt/B004a2Fw4hNnscsz5+6P9wP+o9MIWQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-10T15:03:28.777+0000" -> (known after apply)
      ~ filename                    = "/home/trungle/Desktop/training/github/terraform-training/practice/out/worker/lambda_layer.zip" -> "/home/runner/work/terraform-training/terraform-training/practice/out/worker/lambda_layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-1:057336397237:layer:worker_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "GWmc+c1l/xdt/B004a2Fw4hNnscsz5+6P9wP+o9MIWQ=" -> "wVNW//mj0sP2ef09kbfwE6sPEEZM/knRRo2cbgB+bbM=" # forces replacement
      ~ source_code_size            = 15198683 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Error: reading Lambda Function (tt-practice-dev-cron-server) code signing config: operation error Lambda: GetFunctionCodeSigningConfig, https response error StatusCode: 403, RequestID: e244ad18-a003-4a5b-829c-b489a3dc9013, api error AccessDeniedException: User: arn:aws:sts::057336397237:assumed-role/tt-practice-dev-terraform-plan/GitHubActions-Terraform-19293459275 is not authorized to perform: lambda:GetFunctionCodeSigningConfig on resource: arn:aws:lambda:ap-southeast-1:057336397237:function:tt-practice-dev-cron-server because no identity-based policy allows the lambda:GetFunctionCodeSigningConfig action

  with module.main.module.cron_server.module.lambda_cron_server.aws_lambda_function.cron_server,
  on ../../../components/lambda_cron_server/main.tf line 10, in resource "aws_lambda_function" "cron_server":
  10: resource "aws_lambda_function" "cron_server" {


Error: reading Lambda Function (tt-practice-dev-api-server) code signing config: operation error Lambda: GetFunctionCodeSigningConfig, https response error StatusCode: 403, RequestID: 481db004-714d-4a06-a5b7-98eb6a910d15, api error AccessDeniedException: User: arn:aws:sts::057336397237:assumed-role/tt-practice-dev-terraform-plan/GitHubActions-Terraform-19293459275 is not authorized to perform: lambda:GetFunctionCodeSigningConfig on resource: arn:aws:lambda:ap-southeast-1:057336397237:function:tt-practice-dev-api-server because no identity-based policy allows the lambda:GetFunctionCodeSigningConfig action

  with module.main.module.api_server.module.lambda_fastapi_server.aws_lambda_function.fastapi_server,
  on ../../../components/lambda_fastapi_server/main.tf line 10, in resource "aws_lambda_function" "fastapi_server":
  10: resource "aws_lambda_function" "fastapi_server" {


Error: reading Lambda Function (tt-practice-dev-worker) code signing config: operation error Lambda: GetFunctionCodeSigningConfig, https response error StatusCode: 403, RequestID: cd145da7-294b-48da-8edf-bfd101bf0568, api error AccessDeniedException: User: arn:aws:sts::057336397237:assumed-role/tt-practice-dev-terraform-plan/GitHubActions-Terraform-19293459275 is not authorized to perform: lambda:GetFunctionCodeSigningConfig on resource: arn:aws:lambda:ap-southeast-1:057336397237:function:tt-practice-dev-worker because no identity-based policy allows the lambda:GetFunctionCodeSigningConfig action

  with module.main.module.worker.module.lambda_sqs_worker.aws_lambda_function.sqs_worker,
  on ../../../components/lambda_sqs_worker/main.tf line 10, in resource "aws_lambda_function" "sqs_worker":
  10: resource "aws_lambda_function" "sqs_worker" {

Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @trungleviet-agilityio, Action: `pull_request`, Working Directory: `practice/deploy/30_app/environments/dev`, Workflow: `Terraform CI`*